jet_in_flow/1_icoFoam_laminar_nonmixing/mesh_40/U1_2_U2_8/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|  fvSchemes for icoFoam                                                     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes       { default backward; }

gradSchemes      { default Gauss linear; }

divSchemes
{
    div(phi,U)   Gauss linearUpwind grad(U);
    // Use dev2 on newer OF; if parser complains, switch to dev(T(grad(U)))
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes    { default corrected; }

